# Subsetting and Descriptive Stats

## Before your start:
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import pandas as pd
import numpy as np 

# import plotting libraries
import seaborn as sns
import matplotlib.pyplot as plt

# Challenge 1
#### In this challenge we will use the `temp_states`  dataset. 

#### First import it into a dataframe called `temp`.

In [5]:
temp = pd.read_csv('Temp_States.csv')

#### Print `temp`.

In [7]:
temp.head(10)

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [10]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [13]:
temp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   City         7 non-null      object
 1   State        7 non-null      object
 2   Temperature  7 non-null      float64
dtypes: float64(1), object(2)
memory usage: 296.0+ bytes

Comments:
This is a small database, with 7 rows and 3 columns. 1 column is numerical. There are no nulls and the data types are object and float.

#### Select the rows where state is New York.

In [22]:
temp[(temp['State']=='New York')]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [33]:
avg = temp[(temp['State']=='New York')]

In [40]:
avg.mean()

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [41]:
temp[(temp['Temperature'] > 15)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [84]:
temp[temp['Temperature'] > 15]['City']

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [96]:
temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]['City']

0         NYC
3    Hartford
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [160]:
# Mean
avg_newyork = temp[temp['State']=='New York']['Temperature'].mean()
avg_connecticut = temp[temp['State']=='Connecticut']['Temperature'].mean()
avg_newjersey = temp[temp['State']=='New Jersey']['Temperature'].mean()

print('New York: ', avg_newyork)
print('Connecticut: ', avg_connecticut)
print('New Jersey: ', avg_newjersey)

New York:  10.74074074074074
Connecticut:  15.833333333333332
New Jersey:  21.11111111111111

In [161]:
# Standard deviation
stdev_newyork = temp[temp['State']=='New York']['Temperature'].std()
stdev_connecticut = temp[temp['State']=='Connecticut']['Temperature'].std()
stdev_newjersey = temp[temp['State']=='New Jersey']['Temperature'].std()

print('New York: ', stdev_newyork)
print('Connecticut: ', stdev_connecticut)
print('New Jersey: ', stdev_newjersey)

New York:  8.133404168888054
Connecticut:  1.9641855032959645
New Jersey:  1.5713484026367717

# Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [166]:
employees = pd.read_csv('./Employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [167]:
employees.head(10)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

In [168]:
employees.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        9 non-null      object
 1   Department  9 non-null      object
 2   Education   9 non-null      object
 3   Gender      9 non-null      object
 4   Title       9 non-null      object
 5   Years       9 non-null      int64
 6   Salary      9 non-null      int64
dtypes: int64(2), object(5)
memory usage: 632.0+ bytes

In [169]:
employees.shape

(9, 7)

Comments: This dataframe has 9 rows and 7 columns. 2 columns are numerical, 5 are categorical. There are no nulls and the data types are object and integer.

#### What's the average salary in this company?

In [170]:
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [171]:
employees['Salary'].max()

70

#### What's the lowest salary?

In [172]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [192]:
employees[employees['Salary'] == 30]['Name']

1    Maria
2    David
Name: Name, dtype: object

#### Find all the information about an employee called David.

In [202]:
employees[employees['Name'] == 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [204]:
employees[employees['Name'] == 'David']['Salary']

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [203]:
employees[employees['Title'] == 'associate']

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [205]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [206]:
# Method 2
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [216]:
employees[(employees['Title'] == 'associate') & (employees['Salary'] > 55)]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [217]:
employees.sort_values(['Years'], axis=0)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
5     Eva      Sales  Bachelor      F  associate      2      55
4  Samuel      Sales    Master      M  associate      3      55
3   Sonia         HR  Bachelor      F    analyst      4      35
7   Pedro         IT       Phd      M  associate      7      60
6  Carlos         IT    Master      M         VP      8      70
8     Ana         HR    Master      F         VP      8      70

In [220]:
avg_1year = employees[employees['Years']==1]['Salary'].mean()
avg_2year = employees[employees['Years']==2]['Salary'].mean()
avg_3year = employees[employees['Years']==3]['Salary'].mean()
avg_4year = employees[employees['Years']==4]['Salary'].mean()
avg_7year = employees[employees['Years']==7]['Salary'].mean()
avg_8year = employees[employees['Years']==8]['Salary'].mean()

print('Average salary in 1 year of employment: ', avg_1year)
print('Average salary in 2 years of employment: ', avg_2year)
print('Average salary in 3 years of employment: ', avg_3year)
print('Average salary in 4 years of employment: ', avg_4year)
print('Average salary in 7 years of employment: ', avg_7year)
print('Average salary in 8 years of employment: ', avg_8year)

Average salary in 1 year of employment:  35.0
Average salary in 2 years of employment:  38.333333333333336
Average salary in 3 years of employment:  55.0
Average salary in 4 years of employment:  35.0
Average salary in 7 years of employment:  60.0
Average salary in 8 years of employment:  70.0

####  What is the average salary per title?

In [214]:
avg_salary_analyst = employees[employees['Title']=='analyst']['Salary'].mean()
avg_salary_associate = employees[employees['Title']=='associate']['Salary'].mean()
avg_salary_vp = employees[employees['Title']=='VP']['Salary'].mean()

print('Analyst: ', avg_salary_analyst)
print('Associate: ', avg_salary_associate)
print('VP: ', avg_salary_vp)

Analyst:  32.5
Associate:  56.666666666666664
VP:  70.0

####  Find the salary quartiles.

In [223]:
employees['Salary'].quantile([0.25, 0.50, 0.75, 1])

0.25    35.0
0.50    55.0
0.75    60.0
1.00    70.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [213]:
avg_salary_m = employees[employees['Gender']=='M']['Salary'].mean()
avg_salary_f = employees[employees['Gender']=='F']['Salary'].mean()

print('Male: ', avg_salary_m)
print('Female: ', avg_salary_f)

Male:  50.0
Female:  47.5

Answer: Yes, the salary is different per gender.

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [211]:
# minimum years
min_years_it = employees[employees['Department']=='IT']['Years'].min()
min_years_hr = employees[employees['Department']=='HR']['Years'].min()
min_years_sales = employees[employees['Department']=='Sales']['Years'].min()

# mean years
avg_years_it = employees[employees['Department']=='IT']['Years'].mean()
avg_years_hr = employees[employees['Department']=='HR']['Years'].mean()
avg_years_sales = employees[employees['Department']=='Sales']['Years'].mean()

# maximum years
max_years_it = employees[employees['Department']=='IT']['Years'].max()
max_years_hr = employees[employees['Department']=='HR']['Years'].max()
max_years_sales = employees[employees['Department']=='Sales']['Years'].max()

print('IT: ', min_years_it,',', avg_years_it,',', max_years_it)
print('HR: ', min_years_hr,',', avg_years_hr,',', max_years_hr)
print('Sales: ', min_years_sales,',', avg_years_sales,',', max_years_sales)

IT:  1 , 4.5 , 8
HR:  2 , 4.666666666666667 , 8
Sales:  2 , 2.5 , 3

In [212]:
# minimum salary
min_salary_it = employees[employees['Department']=='IT']['Salary'].min()
min_salary_hr = employees[employees['Department']=='HR']['Salary'].min()
min_salary_sales = employees[employees['Department']=='Sales']['Salary'].min()

# mean salary
avg_salary_it = employees[employees['Department']=='IT']['Salary'].mean()
avg_salary_hr = employees[employees['Department']=='HR']['Salary'].mean()
avg_salary_sales = employees[employees['Department']=='Sales']['Salary'].mean()

# maximum salary
max_salary_it = employees[employees['Department']=='IT']['Salary'].max()
max_salary_hr = employees[employees['Department']=='HR']['Salary'].max()
max_salary_sales = employees[employees['Department']=='Sales']['Salary'].max()

print('IT: ', min_salary_it,',', avg_salary_it,',', max_salary_it)
print('HR: ', min_salary_hr,',', avg_salary_hr,',', max_salary_hr)
print('Sales: ', min_salary_sales,',', avg_salary_sales,',', max_salary_sales)

IT:  30 , 48.75 , 70
HR:  30 , 45.0 , 70
Sales:  55 , 55.0 , 55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# Challenge 3
#### Open the `orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here